{
    "messages": {
      "completeAssessment": {
        "message": "You are helping a user to carry out a risk assessment on a project idea involving data. \n\n Here is the description of the project: \n\n{{title}}. \n\n{{objectives}}\n\nand the data used:\n\n{{dataUsed}}\n\nUsing this context suggest some intended consequnences and unintented consequnences of the project, for each unintended outcome, suggest the impact and likelihood (high, medium or low) of the outcome as well as the role that the organisation should play (act, influence or monitor). Also add mitigating actions to each unintended outcome with a description and stakeholder. Finally create a list of all stakeholders impacted by the project and involved in the actions.\n\nYour response should be in the format of undeclared JSON conforming to the following schema:\n\n{{schema}}\n\nReturn just the data, not the schema."
      },
      "intendedConsequences": {
        "message": "You are helping a user to carry out a risk assessment on a project idea involving data. \n\n Here is the description of the project: \n\n{{title}}. \n\n{{objectives}}\n\nand the data used:\n\n{{dataUsed}}\n\nUsing this context suggest some intended consequnences for the project. Intended consequences are the positive impacts and benefits. This could include improved decision-making, increased efficiency, cost savings, enhanced customer satisfaction, or any other favourable results. \n\nYour response should be in the format of undeclared JSON conforming to the following schema:\n\n{{schema}}\n\nReturn just the data, not the schema."
      },
      "unintendedConsequences": {
        "message": "You are helping a user to carry out a risk assessment on a project idea involving data. \n\n Here is the description of the project: \n\n{{title}}. \n\n{{objectives}}\n\nand the data used:\n\n{{dataUsed}}\n\nUsing this context suggest some unintended consequnences for the project. These unintended consequences can have both positive and negative impacts. Consider the following:\n - Positive Unintended Consequences: Think about unexpected benefits or positive outcomes that might result from the project. For example, improved processes, increased efficiency, or unforeseen uses or users of the product or service.\n - Negative Unintended Consequences: Consider any adverse effects or unexpected problems that might occur. This could involve privacy breaches, data misuse, or potential bias in the data.\n - Secondary Effects: Think about ripple effects that the project might have on other processes, systems, or stakeholders, even if they are not directly involved.\n - External Factors: Take into account external factors or events that the project might interact with or influence. These could include changes in regulations, market conditions, or technological advancements. \n\nYour response should be in the format of undeclared JSON conforming to the following schema:\n\n{{schema}}\n\nReturn just the data, not the schema."
      },
      "stakeholders": {
        "message": "You are helping a user to carry out a risk assessment on a project idea involving data. \n\n Here is the description of the project: \n\n{{title}}. \n\n{{objectives}}\n\nand the data used:\n\n{{dataUsed}}\n\n. We have also defined the following intended consequences of the project: \n\n {{intendedConsequences}}\n\n and potential unintended consequences:\n\n {{unintendedConsequences}} \n\n Using this context suggest some stakeholders (e.g. roles, teams or organisations) that are involved in, or impacted by the project. For each stakeholder, indicate whether they are an internal stakeholder (part of the organisation or project team) or an external stakeholder (outside the organisation or project team). \n\nYour response should be in the format of undeclared JSON conforming to the following schema:\n\n{{schema}}\n\nReturn just the data, not the schema."
      }
    }
  }
