[
    {
        "key": "title",
        "prepend": "<h2>Project title</h2>",
        "notitle": true,
        "htmlClass": "content-block white",
        "fieldHtmlClass": "input inputText",
        "placeholder": "Project title"
    },
    {
        "key": "objectives",
        "type": "textarea",
        "prepend": "<h2>Project overview</h2><p style='color: black;'>Please provide a detailed description of your data project including its general goals and overall purpose. You may wish to include details on the following:</p><ol style='color: black;'><li>Explain how data will be used, processed, stored, and protected throughout the project.</li><li>Provide an estimated project timeline, including key milestones, and important deadlines.</li><li>Mention any relevant data privacy regulations, industry standards, or compliance requirements that the project must adhere to.</li><li>Explain how risks will be monitored throughout the project and the process for reporting and addressing them as they occur.</li></ol><p style='color: black;'>Please be as specific as possible. If you choose to use the assistant AI then the information you provide here will help identify potential risks and generate potential actions for your data project.</p><br/>",
        "notitle": true,
        "placeholder": "Enter objectives...",
        "htmlClass": "content-block white",
        "fieldHtmlClass": "input inputText"
    },
    {
        "key": "dataUsed",
        "type": "textarea",
        "prepend": "<h2>What data will you be using?</h2><p>Provide details on the data that is being utilised within the project. You may wish to include details on the following:</p><ul><li>What type of data is being used? (e.g., customer info, sales data, etc.)</li><li>Where you get the data from? (sources and providers)</li><li>How the data looks? (format, quality)</li><li>How much data there is? (volume)</li><li>Whether there is any sensitive or private information in the data?</li><li>How you keep the data secure?</li><li>Who has access to the data? (team members, external parties)</li><li>Any legal or compliance rules you follow?</li><li>How long you keep the data and how you get rid of it when done?</li></ul><br/>",
        "notitle": true,
        "placeholder": "Description of data",
        "htmlClass": "content-block white",
        "fieldHtmlClass": "input inputText"
    },
    {
        "type": "submit",
        "title": "Proceed to consequences",
        "htmlClass": "submitButton",
        "next": "completeAssessment"
    }

]