{
    "title": "A Charitable Transformation",
    "objectives": "An animal charity is going through a digital transformation process. This charity supports animal care and rehoming. Therefore it holds data on the animals, the users of the service such as those who hand over animals, and those who foster or adopt, as well as data associated with volunteers, donors and broader stakeholders. As part of this transformation the charity wants to retire redundant platforms and consolidate all data and data processes into a single platform. This includes employee record systems, Customer Relationship Management (CRM) platforms, Volunteer Management Systems (VMS) as well as donations, animal welfare data, data supplied by local authorities and information related to internal processes and practices.\n\nObjective: To reduce costs and increase efficiencies by simplifying the digital estate of the charity and reduce the redundancies in existing processes to mitigate risks. The digital transformation should maintain stakeholder privacy and maintain performance in relation to animal care.",
    "stakeholders": [
        { "stakeholder": "Charity Digital Team", "type": "Internal" },
        { "stakeholder": "CFO", "type": "Internal" },
        { "stakeholder": "CTO", "type": "Internal" },
        { "stakeholder": "Board Members", "type": "Internal" },
        { "stakeholder": "Volunteers", "type": "Internal" },
        { "stakeholder": "L&D Team", "type": "Internal" },
        { "stakeholder": "Animal Team", "type": "Internal" },
        { "stakeholder": "Adopters", "type": "External" },
        { "stakeholder": "Donors", "type": "External" },
        { "stakeholder": "Charity Partners)", "type": "External" },
        { "stakeholder": "IT Team", "type": "External" }
    ],
    "dataUsed": "The data the charity holds includes (amongst others): Financial Donors: personal details, level of involvement, etc; Volunteers: personal details, experience, etc; Adopters: potential, previous and existing. Including details of refusals and returns; Users: individuals who have previously handed an animal to the charity.",
    "intendedConsequences": [
        { "consequence": "Reduction of risk from old systems, including privacy, leaks and disparities in data organisation and structure" },
        { "consequence": "More effect analysis and reporting across the charity" },
        { "consequence": "Consolidation of datasets that support more effective and efficient analysis with the potential to increase the performance of charity outputs" },
        { "consequence": "Simplification of workloads and data practices for all employees, with significant benefits for volunteer stakeholders" },
        { "consequence": "Simplification of training and feedback across user groups which reduces the amount of time and resource spent on training and support" },
        { "consequence": "More effective animal support and animal placement into safe homes" },
        { "consequence": "Reduction of misplacements of animals" }
    ],
    "unintendedConsequences": [
        {
            "consequence": "Users of the service are incorrectly profiled and unable to home an animal",
            "action": {
                "description": "Reduce profiling activities of service users to and research additional approaches to reviewing suitability of animal adoption."
            }
        },
        {
            "consequence": "Diverse range of internal users increases the number of data quality issues where data is manually created and input",
            "action": {
                "description": "Implement new/improved data schemas once data is consolidated to ensure that data is managed effectively and sustainably maintained in the longer term."
            }
        },
        {
            "consequence": "Simplified processes and storage leads to overly complex permissions set up and provides disparate or inappropriate access to volunteer staff",
            "action": {
                "description": "Define clear permissions and user groups to ensure that any access to systems by stakeholders is managed and that only relevant data can be accessed, used or shared."
            }
        },
        {
            "consequence": "Increased data breaches due to increase of activities undertaken on a single system",
            "action": {
                "description": "Improve IT security resources to ensure appropriate backup systems to reduce risk of data loss and/or breach."
            }
        },
        {
            "consequence": "Reduced staff resource as efficiencies in practice have negative effect on individual workloads",
            "action": {
                "description": "Design and implement communication and training plans as a process of change management. The focus points should be on transparency and clarity of purpose to ensure that stakeholders understand the what, why and how of the programme and be sufficiently supported in developing new skills.",
                "stakeholder": "L&D Team",
                "date": "2025-03-01"
            }
        },
        {
            "consequence": "Risk of data deletion of duplication of errors in transferring and interacting with data on a single system",
            "action": {
                "description": "Improve IT security resources to ensure appropriate backup systems to reduce risk of data loss and/or breach.",
                "stakeholder": "IT Team",
                "date": "2024-06-01"
            }
        },
        {
            "consequence": "Data held about individuals (personal or otherwise) is used to create profiles that are biassed",
            "action": {
                "description": "Reduce profiling activities of service users to and research additional approaches to reviewing suitability of animal adoption.",
                "stakeholder": "Animal Team",
                "date": "2025-03-01"
            }
        },
        {
            "consequence": "Increase in digital divide for colleagues who are not appropriately supported through large scale digital transformation",
            "action": {
                "description": "Design and implement communication and training plans as a process of change management. The focus points should be on transparency and clarity of purpose to ensure that stakeholders understand the what, why and how of the programme and be sufficiently supported in developing new skills."
            }
        }
    ]
}